In [90]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [5]:
ser = pd.Series()
ser

Series([], dtype: float64)

In [7]:
ser = pd.Series([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [8]:
ser = pd.Series([0,10,20.5,'30'])
ser

0       0
1      10
2    20.5
3      30
dtype: object

In [10]:
dict = {'A':[1,2,5],'B':[5,8,9],'C':[1,2,3]}

In [14]:
df = pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [19]:
df['States'] = "CA NV AZ".split()
df

   A  B  C states States
0  1  5  1     CA     CA
1  2  8  2     NV     NV
2  5  9  3     Az     AZ

In [22]:
dict = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:
df['D'] = [20,30,40]
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [25]:
print('Dropping along column with Nan values \n','-'*35,sep ='')
print(df.dropna(axis =1))

Dropping along column with Nan values
-----------------------------------
   C   D
0  1  20
1  2  30
2  3  40

In [26]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [27]:
print('Dropping along column with Nan values \n','-'*35,sep ='')
print(df.dropna(axis = 0))

Dropping along column with Nan values
-----------------------------------
     A    B  C   D
0  1.0  5.0  1  20

In [28]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [29]:
print('Filling Nan values\n','-'*30,sep = '')
print(df.fillna(value = 50))

Filling Nan values
------------------------------
      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  30
2  50.0  50.0  3  40

In [30]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [32]:
print('Filling nan values with computeed value\n','-'*30,sep = '')
df.fillna(value = df['C'].mean(),inplace = True)
print(df)

Filling nan values with computeed value
------------------------------
     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  30
2  2.0  2.0  3  40

In [33]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  30
2  2.0  2.0  3  40

In [34]:
data = {'Compnay':['Goog','Goog','MFST','MFST','FB','FB'],'Person':['Sam','Charlie','Ammy','Van','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Compnay   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    MFST     Ammy    340
3    MFST      Van    124
4      FB     Carl    243
5      FB    Sarah    350

In [36]:
bycomp = df.groupby('Compnay')
print('Group by company and mean sales\n','-'*30,sep ='')
print(bycomp.mean())

Group by company and mean sales
------------------------------
         Sales
Compnay
FB       296.5
Goog     160.0
MFST     232.0

In [38]:
bycomp = df.groupby('Compnay')
print('Group by company and total sales\n','-'*30,sep ='')
print(bycomp.sum())

Group by company and total sales
------------------------------
         Sales
Compnay
FB         593
Goog       320
MFST       464

In [50]:
class_a = pd.DataFrame({'Mat':[20,30,40],'Eng':[12,45,23],
                 'Sci':[32,43,41],},
                 index = ['Ravi','Shyam','Mohan'])
class_a

       Mat  Eng  Sci
Ravi    20   12   32
Shyam   30   45   43
Mohan   40   23   41

In [51]:
class_b = pd.DataFrame({'Mat':[22,33,34],'Eng':[20,42,22],
                 'Sci':[23,55,60],},
                 index = ['Ram','Shya','Moh'])
class_b

      Mat  Eng  Sci
Ram    22   20   23
Shya   33   42   55
Moh    34   22   60

In [52]:
class_c = pd.DataFrame({'Mat':[27,30,35],'Eng':[28,40,62],
                 'Sci':[33,45,50],},
                 index = ['Rohit','Sam','Molly'])
class_c

       Mat  Eng  Sci
Rohit   27   28   33
Sam     30   40   45
Molly   35   62   50

In [53]:
all_students_marks = pd.concat([class_a,class_b,class_c],axis =0)
all_students_marks

       Mat  Eng  Sci
Ravi    20   12   32
Shyam   30   45   43
Mohan   40   23   41
Ram     22   20   23
Shya    33   42   55
Moh     34   22   60
Rohit   27   28   33
Sam     30   40   45
Molly   35   62   50

In [54]:
df_cat2 = pd.concat([class_a,class_b,class_c],axis =1)
print(df_cat2)

        Mat   Eng   Sci   Mat   Eng   Sci   Mat   Eng   Sci
Ravi   20.0  12.0  32.0   NaN   NaN   NaN   NaN   NaN   NaN
Shyam  30.0  45.0  43.0   NaN   NaN   NaN   NaN   NaN   NaN
Mohan  40.0  23.0  41.0   NaN   NaN   NaN   NaN   NaN   NaN
Ram     NaN   NaN   NaN  22.0  20.0  23.0   NaN   NaN   NaN
Shya    NaN   NaN   NaN  33.0  42.0  55.0   NaN   NaN   NaN
Moh     NaN   NaN   NaN  34.0  22.0  60.0   NaN   NaN   NaN
Rohit   NaN   NaN   NaN   NaN   NaN   NaN  27.0  28.0  33.0
Sam     NaN   NaN   NaN   NaN   NaN   NaN  30.0  40.0  45.0
Molly   NaN   NaN   NaN   NaN   NaN   NaN  35.0  62.0  50.0

In [55]:
df_cat2.fillna(value = 0,inplace = True)
df_cat2

        Mat   Eng   Sci   Mat   Eng   Sci   Mat   Eng   Sci
Ravi   20.0  12.0  32.0   0.0   0.0   0.0   0.0   0.0   0.0
Shyam  30.0  45.0  43.0   0.0   0.0   0.0   0.0   0.0   0.0
Mohan  40.0  23.0  41.0   0.0   0.0   0.0   0.0   0.0   0.0
Ram     0.0   0.0   0.0  22.0  20.0  23.0   0.0   0.0   0.0
Shya    0.0   0.0   0.0  33.0  42.0  55.0   0.0   0.0   0.0
Moh     0.0   0.0   0.0  34.0  22.0  60.0   0.0   0.0   0.0
Rohit   0.0   0.0   0.0   0.0   0.0   0.0  27.0  28.0  33.0
Sam     0.0   0.0   0.0   0.0   0.0   0.0  30.0  40.0  45.0
Molly   0.0   0.0   0.0   0.0   0.0   0.0  35.0  62.0  50.0

In [56]:
player_id_name = pd.DataFrame({'ID':[25,30,40,50],'Name':['Sachin','Virat','Lax','Anil']})
player_id_name

   ID    Name
0  25  Sachin
1  30   Virat
2  40     Lax
3  50    Anil

In [57]:
player_details = pd.DataFrame({'ID':[25,40,50],'Age':[33,45,57],'City':['Bombay','Del','Hyd']})
player_details

   ID  Age    City
0  25   33  Bombay
1  40   45     Del
2  50   57     Hyd

In [58]:
pd.merge(player_id_name,player_details,on ='ID')

   ID    Name  Age    City
0  25  Sachin   33  Bombay
1  40     Lax   45     Del
2  50    Anil   57     Hyd

In [62]:
left = pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']},index = ['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C2','C3'],'D':['D0','D2','D3']},index = ['K0','K2','K3'])

In [63]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [64]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [65]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [66]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [89]:
import pandas as pd

In [68]:
def salary_hike(x):
    if (x > 3000):
        return np.ceil(x * 1.30)
    else:
        return np.ceil(x*1.5)

In [69]:
df = pd.DataFrame({'Dep':[1,2,3,4],'Emp':['Ajit','Max','Lax','Tom'],'salary':[1000,4000,3200,1500]})
df

   Dep   Emp  salary
0    1  Ajit    1000
1    2   Max    4000
2    3   Lax    3200
3    4   Tom    1500

In [70]:
df['New_Salary'] = df['salary'].apply(salary_hike)
df

   Dep   Emp  salary  New_Salary
0    1  Ajit    1000      1500.0
1    2   Max    4000      5200.0
2    3   Lax    3200      4160.0
3    4   Tom    1500      2250.0

In [71]:
df['Name_length'] = df['Emp'].apply(len)
df

   Dep   Emp  salary  New_Salary  Name_length
0    1  Ajit    1000      1500.0            4
1    2   Max    4000      5200.0            3
2    3   Lax    3200      4160.0            3
3    4   Tom    1500      2250.0            3

In [73]:
df['New_Salary'].apply(lambda x : np.sqrt(x))

0    38.729833
1    72.111026
2    64.498062
3    47.434165
Name: New_Salary, dtype: float64

In [76]:
print('Min & Max of New_Salary is:',df['New_Salary'].min(),'and',df['New_Salary'].max())

Min & Max of New_Salary is: 1500.0 and 5200.0

In [79]:
print('Name of coloumn \n','-'*30,sep= '')
print(df.columns)

Name of coloumn
------------------------------
Index(['Dep', 'Emp', 'salary', 'New_Salary', 'Name_length'], dtype='object')

In [80]:
l = list(df.columns)
print('Cloumns Name in last for later manipulation',l)

Cloumns Name in last for later manipulation ['Dep', 'Emp', 'salary', 'New_Salary', 'Name_length']

In [82]:
del df['salary']
df

   Dep   Emp  New_Salary  Name_length
0    1  Ajit      1500.0            4
1    2   Max      5200.0            3
2    3   Lax      4160.0            3
3    4   Tom      2250.0            3

In [83]:
df.sort_values(by = 'New_Salary')

   Dep   Emp  New_Salary  Name_length
0    1  Ajit      1500.0            4
3    4   Tom      2250.0            3
2    3   Lax      4160.0            3
1    2   Max      5200.0            3

In [85]:
df.sort_values(by = 'New_Salary',ascending =False)

   Dep   Emp  New_Salary  Name_length
1    2   Max      5200.0            3
2    3   Lax      4160.0            3
3    4   Tom      2250.0            3
0    1  Ajit      1500.0            4

In [93]:
df = pd.DataFrame({'Name':['Ramesh','Raghav',np.nan,np.nan],'Gender':[np.nan,'M','M','F']
                  ,'Section':['A','D','C','E'],'Class':[5,12,np.nan,np.nan],
                  'Phone_Number':[np.nan,67788,665443,np.nan],
                  'Location':['Bengalure','Noida','Hyderabad',np.nan],
                  'Email_Present':['Y','N',np.nan,np.nan],
                  'Door_No':[np.nan,777,888,999],
                  'Street_Name':['abc','vgh','ghi','kjl'],
                  'Pin_Code':[5,12,np.nan,np.nan],'State':[np.nan,'UP','Bihar',np.nan],
                  'Dad_Name':['xyz','mnb','zxc',np.nan]},dtype = int)
df

,Name,Gender,Section,Class,Phone_Number,Location,Email_Present,Door_No,Street_Name,Pin_Code,State,Dad_Name
0,Ramesh,NaN,A,5,NaN,Bengalure,Y,NaN,abc,5,NaN,xyz
1,Raghav,M,D,12,67788,Noida,N,777,vgh,12,UP,mnb
2,NaN,M,C,NaN,665443,Hyderabad,NaN,888,ghi,NaN,Bihar,zxc
3,NaN,F,E,NaN,NaN,NaN,NaN,999,kjl,NaN,NaN,NaN

In [95]:
df.isnull().sum()

Name             2
Gender           1
Section          0
Class            2
Phone_Number     2
Location         1
Email_Present    2
Door_No          1
Street_Name      0
Pin_Code         2
State            2
Dad_Name         1
dtype: int64